Repository: pingfangx/TranslatorX-other
Catalog: GitDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: For conflicting paths, the index file records up to three versions, as described in the "TRUE MERGE" section of git-merge[1].
zh_cn: 对于冲突的路径，索引文件最多记录三个版本，如 git-merge[1] 的"TRUE MERGE"部分所述。

source: For each access, the pack file name and an offset in the pack is recorded.
zh_cn: 对于每个访问，记录包文件名和包中的偏移量。

source: For each file you edit, you need to tell Git that the conflict has been resolved, typically this would be done with
zh_cn: 对于您编辑的每个文件，您需要告诉 Git 冲突已被解决，通常情况下会这样做

source: For each path GIT_EXTERNAL_DIFF is called, two environment variables, GIT_DIFF_PATH_COUNTER and GIT_DIFF_PATH_TOTAL are set.
zh_cn: 对于调用每个路径 GIT_EXTERNAL_DIFF ，将设置两个环境变量 GIT_DIFF_PATH_COUNTER 和 GIT_DIFF_PATH_TOTAL 。

source: For each pathname given via the command-line or from a file via --stdin, check whether the file is excluded by .gitignore (or other input files to the exclude mechanism) and output the path if it is excluded.
zh_cn: 对于通过命令行或通过 --stdin 从文件给出的每个路径名，检查文件是否被 .gitignore(或排除机制的其他输入文件)排除，并输出路径如果被排除在外。

source: For example CET (which is 1 hour ahead of UTC) is +0100.
zh_cn: 例如 CET(比 UTC 提前1个小时)是 +0100 。

source: For example the following invocations are equivalent:
zh_cn: 例如，以下调用是等效的：

source: For example, "/*.c" matches "cat-file.c" but not "mozilla-sha1/sha1.c".
zh_cn: 例如，"/*.c" 匹配 "cat-file.c" 但不匹配 "mozilla-sha1/sha1.c"。

source: For example, "a/**/b" matches "a/b", "a/x/b", "a/x/y/b" and so on.
zh_cn: 例如，"a/**/b" 匹配 "a/b"，"a/x/b"，"a/x/y/b" 等等。

source: For example, "**/foo" matches file or directory "foo" anywhere, the same as pattern "foo".
zh_cn: 例如，"**/foo" 与任何地方的文件或目录 "foo" 匹配，与模式“ foo ”相同。

source: For example, "abc/**" matches all files inside directory "abc", relative to the location of the .gitignore file, with infinite depth.
zh_cn: 例如，"abc/**" 匹配目录 "abc" 内的所有文件，相对于 .gitignore 文件的位置，无限深度。

source: For example, "Documentation/*.html" matches "Documentation/git.html" but not "Documentation/ppc/ppc.html" or "tools/perf/Documentation/perf.html".
zh_cn: 例如， "Documentation/*.html" 匹配 "Documentation/git.html" ，但不匹配 "Documentation/ppc/ppc.html" 或 "tools/perf/Documentation/perf.html".

source: For example, git-format-patch[1] turns a commit into email, and it uses the title on the Subject line and the rest of the commit in the body.
zh_cn: 例如， git-format-patch[1] 将提交转换为电子邮件，它使用主题行上的标题和身体中的其他提交。

source: For example, HEAD@{2} means "where HEAD used to be two moves ago", master@{one.week.ago} means "where master used to point to one week ago in this local repository", and so on.
zh_cn: 例如，HEAD@{2} 表示 "HEAD 两个移动以前"， master@{one.week.ago} 表示 "master 一个星期前在这个本地的仓库的指向"，等等。

source: For example, git commit --amend --no-edit amends a commit without changing its commit message.
zh_cn: 例如， git commit --amend --no-edit 修改提交而不更改其提交消息。

source: For example, Documentation/*.jpg will match all .jpg files in the Documentation subtree, including Documentation/chapter_1/figure_1.jpg.
zh_cn: 例如，Documentation/*.jpg 将匹配文档子树中的所有 .jpg 文件，包括 Documentation/chapter_1/figure_1.jpg 。

source: For example, a feature developed in topic depends on some functionality which is found in next.
zh_cn: 例如， topic 中开发的功能取决于 next 中的一些功能。

source: For example, for the command git clone <repo>, you can either use:
zh_cn: 例如，对于命令 git clone <repo> ，您可以使用：

source: For example, if you are on branch blabla then @{1} means the same as blabla@{1}.
zh_cn: 例如，如果你在分支 blabla ，那么 @{1} 意味着与 blabla@{1} 相同。

source: For example, introducing a new line into the index that is in neither the HEAD nor the working tree will stage the new line for commit, but the line will appear to be reverted in the working tree.
zh_cn: 例如，将新行引入到既不在 HEAD 中也不在工作树中的索引中，将为新的行提交提交，但该行将在工作树中显示为还原。

source: For example, running git rebase master on the following history (in which A' and A introduce the same set of changes, but have different committer information):
zh_cn: 例如，在以下历史上运行 git rebase master (其中 A' 和 A 引入了同一组更改，但具有不同的提交者信息)：

source: For example, running GIT_LITERAL_PATHSPECS=1 git log -- '*.c' will search for commits that touch the path *.c, not any paths that the glob *.c matches.
zh_cn: 例如，运行 GIT_LITERAL_PATHSPECS=1 git log -- '*.c' 将搜索匹配路径 *.c 的提交，而不是 glob *.c 匹配的路径。

source: For example, to default to pushing only the current branch to origin use git config remote.origin.push HEAD.
zh_cn: 例如，使用 git config remote.origin.push HEAD 默认只将当前分支推送到 origin 。

source: For more information about creating annotated tags see the -a and -s options to git-tag[1].
zh_cn: 有关创建带注释的标签的更多信息，请参阅-a 和-s 选项，使用 git-tag[1] 。

source: For more information about submodules, see gitsubmodules[7].
zh_cn: 有关子模块的更多信息，请参见 gitsubmodules[7] 。

source: For plain blobs, it shows the plain contents.
zh_cn: 对于普通的 blobs，它显示了普通的内容。

source: For reading options: read only from global ~/.gitconfig and from $XDG_CONFIG_HOME/git/config rather than from all available files.
zh_cn: 读取选项：读取只从全局的 ~/.gitconfig 和 $XDG_CONFIG_HOME/git/config 而不是所有可用的文件。

source: For reading options: read only from system-wide $(prefix)/etc/gitconfig rather than from all available files.
zh_cn: 读取选项：读取只从系统范围的 $(prefix)/etc/gitconfig 而不是所有可用的文件。

source: For reading options: read only from the repository .git/config rather than from all available files.
zh_cn: 读取选项：读取只从仓库的 .git/config ，而不是所有可用的文件。

source: For tags, it shows the tag message and the referenced objects.
zh_cn: 对于标签，它显示标签消息和引用对象。

source: For this reason, some git commands for naming objects (like git describe) will ignore lightweight tags by default.
zh_cn: 为此，一些用于命名对象的 git 命令(如 git describe )将默认忽略轻量级标签。

source: For trees, it shows the names (equivalent to git ls-tree with --name-only).
zh_cn: 对于树，它显示名称(相当于 git ls-tree 带有 --name-only )。

source: For writing options: write to global ~/.gitconfig file rather than the repository .git/config, write to $XDG_CONFIG_HOME/git/config file if this file exists and the ~/.gitconfig file doesn’t.
zh_cn: 写入选项：写入全局 ~/.gitconfig 文件，而不是仓库 .git/config ，写入 $XDG_CONFIG_HOME/git/config 文件，如果此文件存在，并且 ~/.gitconfig 文件不存在。

source: For writing options: write to system-wide $(prefix)/etc/gitconfig rather than the repository .git/config.
zh_cn: 对于写入选项：写入系统范围的 $(prefix)/etc/gitconfig 而不是仓库 .git/config 。

source: For writing options: write to the repository .git/config file.
zh_cn: 写入选项：写入仓库 .git/config 文件。

source: Force renaming or moving of a file even if the target exists
zh_cn: 强制重命名或移动文件，即使目标已存在

source: Force the cloning process from a repository on a local filesystem to copy the files under the .git/objects directory instead of using hardlinks.
zh_cn: 强制克隆过程从本地文件系统上的仓库复制 .git/objects 目录下的文件，而不是使用硬链接。

source: Forcing git fetch to do non-fast-forward updates
zh_cn: 强制 git fetch 执行非快速更新

source: Forget about the current operation in progress.
zh_cn: 忘记当前正在进行的操作。

source: From this point, the result of either of the following commands:
zh_cn: 从这一点，以下任一命令的结果：

source: Further chapters cover more specialized topics.
zh_cn: 其他章节涵盖更专业的主题。

source: Further fetches into the resulting repository will only update the remote-tracking branch for the branch this option was used for the initial cloning.
zh_cn: 进一步获取到仓库将仅更新用于初始克隆的此选项的分支的远程跟踪分支。

source: GUI Clients
zh_cn: GUI 客户端

source: Generate a request asking your upstream project to pull changes into their tree.
zh_cn: 生成一个请求，要求您的上游项目将更改拉入其树。

source: Generates a summary of pending changes
zh_cn: 生成待更改的摘要

source: Generating diffs
zh_cn: 生成 diff

source: Generating patches with -p
zh_cn: 用 -p 生成补丁

source: Get and set repository or global options
zh_cn: 获取和设置仓库或全局选项

source: Get the value for a given key (optionally filtered by a regex matching the value).
zh_cn: 获取给定键的值(可选地由与该值匹配的正则表达式过滤)。

source: Getting and Creating Projects
zh_cn: 获取与创建项目

source: Getting conflict-resolution help during a merge
zh_cn: 在合并期间获得解决冲突的帮助

source: Getting updates with git pull
zh_cn: 用 git pull 拉取更新

source: Git - git Documentation
zh_cn: Git - git 文档

source: Git - git-add Documentation
zh_cn: Git - git-add 文档

source: Git - git-am Documentation
zh_cn: Git - git-am 文档

source: Git - git-apply Documentation
zh_cn: Git - git-apply 文档

source: Git - git-archive Documentation
zh_cn: Git - git-archive 文档

source: Git - git-bisect Documentation
zh_cn: Git - git-bisect 文档

source: Git - git-blame Documentation
zh_cn: Git - git-blame 文档

source: Git - git-branch Documentation
zh_cn: Git - git-branch 文档

source: Git - git-bundle Documentation
zh_cn: Git - git-bundle 文档

source: Git - git-cat-file Documentation
zh_cn: Git - git-cat-file 文档

source: Git - git-check-ignore Documentation
zh_cn: Git - git-check-ignore 文档

source: Git - git-checkout Documentation
zh_cn: Git - git-checkout 文档

source: Git - git-cherry-pick Documentation
zh_cn: Git - git-cherry-pick 文档

source: Git - git-clean Documentation
zh_cn: Git - git-clean 文档

source: Git - git-clone Documentation
zh_cn: Git - git-clone 文档

source: Git - git-commit Documentation
zh_cn: Git - git-commit 文档

source: Git - git-commit-tree Documentation
zh_cn: Git - git-commit-tree 文档

source: Git - git-config Documentation
zh_cn: Git - git-config 文档

source: Git - git-count-objects Documentation
zh_cn: Git - git-count-objects 文档

source: Git - git-daemon Documentation
zh_cn: Git - git-daemon 文档

source: Git - git-describe Documentation
zh_cn: Git - git-describe 文档

source: Git - git-diff Documentation
zh_cn: Git - git-diff 文档

source: Git - git-diff-index Documentation
zh_cn: Git - git-diff-index 文档

source: Git - git-fast-import Documentation
zh_cn: Git - git-fast-import 文档

source: Git - git-fetch Documentation
zh_cn: Git - git-fetch 文档

source: Git - git-filter-branch Documentation
zh_cn: Git - git-filter-branch 文档

source: Git - git-for-each-ref Documentation
zh_cn: Git - git-for-each-ref 文档

source: Git - git-format-patch Documentation
zh_cn: Git - git-format-patch 文档

source: Git - git-fsck Documentation
zh_cn: Git - git-fsck 文档

source: Git - git-gc Documentation
zh_cn: Git - git-gc 文档

source: Git - git-grep Documentation
zh_cn: Git - git-grep 文档

source: Git - git-hash-object Documentation
zh_cn: Git - git-hash-object 文档

source: Git - git-help Documentation
zh_cn: Git - git-help 文档

source: Git - git-init Documentation
zh_cn: Git - git-init 文档

source: Git - git-instaweb Documentation
zh_cn: Git - git-instaweb 文档

source: Git - git-log Documentation
zh_cn: Git - git-log 文档

source: Git - git-ls-files Documentation
zh_cn: Git - git-ls-files 文档

source: Git - git-merge Documentation
zh_cn: Git - git-merge 文档

source: Git - git-merge-base Documentation
zh_cn: Git - git-merge-base 文档

source: Git - git-mergetool Documentation
zh_cn: Git - git-mergetool 文档

source: Git - git-mv Documentation
zh_cn: Git - git-mv 文档

source: Git - git-pull Documentation
zh_cn: Git - git-pull 文档

source: Git - git-push Documentation
zh_cn: Git - git-push 文档

source: Git - git-read-tree Documentation
zh_cn: Git - git-read-tree 文档

source: Git - git-rebase Documentation
zh_cn: Git - git-rebase 文档

source: Git - git-reflog Documentation
zh_cn: Git - git-reflog 文档

source: Git - git-remote Documentation
zh_cn: Git - git-remote 文档

source: Git - git-request-pull Documentation
zh_cn: Git - git-request-pull 文档

source: Git - git-reset Documentation
zh_cn: Git - git-reset 文档

source: Git - git-rev-list Documentation
zh_cn: Git - git-rev-list 文档

source: Git - git-rev-parse Documentation
zh_cn: Git - git-rev-parse 文档

source: Git - git-revert Documentation
zh_cn: Git - git-revert 文档

source: Git - git-rm Documentation
zh_cn: Git - git-rm 文档

source: Git - git-send-email Documentation
zh_cn: Git - git-send-email 文档

source: Git - git-shortlog Documentation
zh_cn: Git - git-shortlog 文档

source: Git - git-show Documentation
zh_cn: Git - git-show 文档

source: Git - git-show-ref Documentation
zh_cn: Git - git-show-ref 文档

source: Git - git-stash Documentation
zh_cn: Git - git-stash 文档

source: Git - git-status Documentation
zh_cn: Git - git-status 文档

source: Git - git-submodule Documentation
zh_cn: Git - git-submodule 文档

source: Git - git-svn Documentation
zh_cn: Git - git-svn 文档

source: Git - git-symbolic-ref Documentation
zh_cn: Git - git-symbolic-ref 文档

source: Git - git-tag Documentation
zh_cn: Git - git-tag 文档

source: Git - git-update-index Documentation
zh_cn: Git - git-update-index 文档

source: Git - git-update-ref Documentation
zh_cn: Git - git-update-ref 文档

source: Git - git-update-server-info Documentation
zh_cn: Git - git-update-server-info 文档

source: Git - git-verify-pack Documentation
zh_cn: Git - git-verify-pack 文档

source: Git - git-write-tree Documentation
zh_cn: Git - git-write-tree 文档

source: Git - gitattributes Documentation
zh_cn: Git - gitattributes 文档

source: Git - giteveryday Documentation
zh_cn: Git - giteveryday 文档

source: Git - gitglossary Documentation
zh_cn: Git - gitglossary 文档

source: Git - gitignore Documentation
zh_cn: Git - gitignore 文档

source: Git - gitmodules Documentation
zh_cn: Git - gitmodules 文档

source: Git - gitrevisions Documentation
zh_cn: Git - gitrevisions 文档

source: Git - gittutorial Documentation
zh_cn: Git - gittutorial 文档

source: Git - gitworkflows Documentation
zh_cn: Git - gitworkflows 文档

source: Git - user-manual Documentation
zh_cn: Git - user-manual 文档

source: Git Commits
zh_cn: Git 提交

source: Git Glossary
zh_cn: Git 词汇表

source: Git concepts
zh_cn: Git 概念

source: Git data exporter
zh_cn: Git 数据导出器

source: Git doesn’t list excluded directories for performance reasons, so any patterns on contained files have no effect, no matter where they are defined.
zh_cn: 出于性能原因，Git 不会列出已排除的目录，因此任何包含文件的模式都不起作用，无论它们在何处被定义。

source: Git internal format
zh_cn: Git 内部格式

source: Git is a fast distributed revision control system.
zh_cn: Git 是一个快速分布式版本控制系统。

source: Git is a fast, scalable, distributed revision control system with an unusually rich command set that provides both high-level operations and full access to internals.
zh_cn: Git 是一个快速，可扩展的分布式版本控制系统，具有非常丰富的命令集，可提供高级操作和完全访问内部部件。

source: Git is a member of Software Freedom Conservancy
zh_cn: Git 是 Software Freedom Conservancy 的成员

source: Git is to some extent character encoding agnostic.
zh_cn: Git 在某种程度上字符编码是不可知的。

source: Git sets this variable automatically when performing destructive operations like git-prune[1].
zh_cn: 执行诸如 git-prune[1] 的破坏性操作时，Git 会自动设置此变量。

source: Git supports ssh, git, http, and https protocols (in addition, ftp, and ftps can be used for fetching, but this is inefficient and deprecated; do not use it).
zh_cn: Git 支持 ssh，git，http 和 https 协议(此外，ftp 和 ftps 可以用于抓取，但这是低效和不推荐的;不要使用它)。

source: Git tracks content not files
zh_cn: Git 跟踪内容而不是文件

source: Git treats the pattern as a shell glob suitable for consumption by fnmatch(3) with the FNM_PATHNAME flag: wildcards in the pattern will not match a / in the pathname.
zh_cn: Git 将模式视为适合 fnmatch(3) 使用 FNM_PATHNAME 标志的 shell glob：模式中的通配符与路径名中的/不匹配。

source: Git users can broadly be grouped into four categories for the purposes of describing here a small set of useful command for everyday Git.
zh_cn: Git 用户可以广泛地分为四类，以便在此描述每天 Git 的一小组有用的命令。

source: Git uses a simple text format to store customizations that are per repository and are per user.
zh_cn: Git 使用简单的文本格式来存储每个仓库和每个用户的自定义配置。

source: Git was started by Linus Torvalds, and is currently maintained by Junio C Hamano.
zh_cn: Git 由 Linus Torvalds 启动，目前由 Junio C Hamano 维护。

source: Git web interface (web frontend to Git repositories)
zh_cn: Git Web 界面(Web 前端到 Git 仓库)

source: Git will refuse to delete directories with .git sub directory or file unless a second -f is given.
zh_cn: Git 将拒绝删除具有 .git 子目录或文件的目录，除非给出了第二个 -f 。

source: Git’s i18n setup code for shell scripts
zh_cn: Git 的 shell 脚本的国际化设置代码

source: Give the output in the long-format.
zh_cn: 给出长格式的输出。

source: Give the output in the short-format.
zh_cn: 以短格式输出。

source: Given a .git/config like this:
zh_cn: 给出一个 .git/config，如下所示：

source: Given one or more existing commits, apply the change each one introduces, recording a new commit for each.
zh_cn: 给定一个或多个现有提交，应用每个提交引入的更改，为每个应用记录为一个新的提交。

source: Given one or more existing commits, revert the changes that the related patches introduce, and record some new commits that record them.
zh_cn: 给定一个或多个已存在的提交，还原相关补丁引入的更改，为每个应用记录为一个新的提交。

source: Gives some information about the remote <name>.
zh_cn: 提供有关远程<name>的一些信息。

source: Giving the name of a file that you have not told Git about does not remove that file.
zh_cn: 给出你没有告诉 Git 的文件的名称不会移除该文件。

source: Glob magic is incompatible with literal magic.
zh_cn: Glob 魔法与 literal 魔法不相容。

source: Graduation
zh_cn: 毕业

source: Graphical alternative to git-commit
zh_cn: 图形替代 git-commit

source: Guides
zh_cn: 指南

source: HEAD is a reference to one of the heads in your repository, except when using a detached HEAD, in which case it directly references an arbitrary commit.
zh_cn: HEAD 是您的存储库中的一个 heads 之一的引用，除了使用 detached HEAD 之外，在这种情况下，它直接引用任意的提交。

source: HOOKS
zh_cn: 钩子

source: Hacking Git
zh_cn: 黑客 Git

source: Heads are stored in a file in $GIT_DIR/refs/heads/ directory, except when using packed refs.
zh_cn: 头存储在 $GIT_DIR/refs/heads/ 目录中的文件中，除了使用打包的引用。

source: Helper to store credentials on disk
zh_cn: 帮助在磁盘上存储凭据

source: Helper to temporarily store passwords in memory
zh_cn: 帮助临时将密码存储在内存中

source: Here are the details of the built-in formats:
zh_cn: 以下是内置格式的详细信息：

source: Here are various ways to spell object names.
zh_cn: 以下是拼写对象名称的各种方法。

source: Here is an illustration, by Jon Loeliger.
zh_cn: 这是 Jon Loeliger 的例证。

source: Here is how you would transplant a topic branch based on one branch to another, to pretend that you forked the topic branch from the latter branch, using rebase --onto.
zh_cn: 这里是如何将基于一个分支的 topic 分支移到到另一个分支上，以假装您是从后一个分支派生的 topic 分支，使用 rebase --onto。

source: High-level commands (porcelain)
zh_cn: 高级命令(porcelain)

source: Higher level SCMs may provide and manage additional information in the $GIT_DIR.
zh_cn: 较高级别的 SCM 可以提供和管理 $GIT_DIR 中的附加信息。

source: Higher-level Git tools, such as git status and git add, use patterns from the sources specified above.
zh_cn: 更高级的 Git 工具，例如 git status 和 git add ，使用上面指定的源的模式。

source: History Simplification
zh_cn: 历史简化

source: Housekeeping is required if there are too many loose objects or too many packs in the repository.
zh_cn: 如果储存库中有太多松散的物体或太多的包装，则需要家政服务。

source: How Git stores objects efficiently: pack files
zh_cn: Git 如何有效地存储对象：打包文件

source: How to check out a different version of a project
zh_cn: 如何检出项目的不同版本

source: How to get a Git repository
zh_cn: 如何获取 Git 仓库

source: How to get a Git repository with minimal history
zh_cn: 如何获取具有最少历史记录的 Git 仓库

source: How to make a commit
zh_cn: 如何做提交

source: How to merge
zh_cn: 如何合并

source: How to use bisect to find a regression
zh_cn: 如何使用二分法查找回归

source: However, "diff" is about comparing two endpoints, not ranges, and the range notations ("<commit>..<commit>" and "<commit>...<commit>") do not mean a range as defined in the "SPECIFYING RANGES" section in gitrevisions[7].
zh_cn: 然而，“diff”是关于比较两个 endpoints 而不是范围和范围符号(“<commit> .. <commit>”和“<commit> ... <commit>”)不代表 gitrevisions[7] 中“SPECIFYING RANGES”部分中定义的范围。

source: However, depending on the use case, there are several ways that can be done.
zh_cn: 但是，根据用例，可以通过几种方法来完成。

source: However, enabling it may help git to detect and abort some operations in the presence of broken refs.
zh_cn: 然而，启用它可能有助于 Git 在断开的引用文件中检测和中止某些操作。

source: However, if even this access is slow, you can add an empty entry to the list to tell Git that the subsequent entries are not symlinks and needn’t be resolved; e.g., GIT_CEILING_DIRECTORIES=/maybe/symlink::/very/slow/non/symlink.
zh_cn: 但是，如果这个访问速度很慢，您可以向列表中添加一个空条目，告诉 Git 后续条目不是符号链接，不需要解析;如 GIT_CEILING_DIRECTORIES=/maybe/symlink::/very/slow/non/symlink.

source: However, if the file is absent from the tree of some commit, a simple rm filename will fail for that tree and commit.
zh_cn: 但是，如果文件不在某个提交的树中，那么对该树和提交的一个简单的 rm filename 将失败。

source: However, if there were uncommitted changes when the merge started (and especially if those changes were further modified after the merge was started), git merge --abort will in some cases be unable to reconstruct the original (pre-merge) changes.
zh_cn: 但是，如果在合并开始时有未提交的更改(特别是如果这些更改在合并开始后进一步修改)， git merge --abort 将在某些情况下无法重建原始(预合并)更改。

source: However, in neither case will an error message be issued.
zh_cn: 但是，在任何一种情况下都不会发出错误消息。

source: However, it is easy to confuse oneself and create a patch that does not apply to the index.
zh_cn: 但是，很容易混淆自己，并创建一个不适用于索引的补丁。

source: However, their changes are not lost — they are still staged and merely held back.
zh_cn: 然而，他们的变化并没有消失 - 他们仍然暂存，只是被阻止。

source: However, there are cases in which your local changes do conflict with the upstream changes, and git pull refuses to overwrite your changes.
zh_cn: 但是，有些情况是您的本地更改与上游更改相冲突，而 git pull 拒绝覆盖您的更改。

source: However, this does not necessarily mean that git rebase expects the result of this edit to be exactly one commit.
zh_cn: 然而，这并不一定意味着 git rebase 希望这个编辑的结果只是一个提交。

source: However, your "wrong" branch and correct "mytopic" branch may differ in files that you have modified locally, in which case the above checkout would fail like this:
zh_cn: 但是，您的“错误”分支和正确的“mytopic”分支可能会在您在本地进行修改的文件中有所不同，在这种情况下，上述检出将会失败：

source: I.e. <rev>~3 is equivalent to <rev>^^^ which is equivalent to <rev>^1^1^1.
zh_cn: 即 <rev>~3 相当于 <rev>^^^ ，相当于 <rev>^1^1^1 。

source: INTERACTIVE MODE
zh_cn: 交互模式

source: Identifier Terminology
zh_cn: 标识符术语

source: If $XDG_CONFIG_HOME is either not set or empty, $HOME/.config/git/ignore is used instead.
zh_cn: 如果 $XDG_CONFIG_HOME/git/ignore 未设置或为空，则使用 $HOME/.config/git/ignore 。

source: If $XDG_CONFIG_HOME is not set or empty, $HOME/.config/git/config will be used.
zh_cn: 如果$ XDG_CONFIG_HOME 未设置或为空，则将使用 $HOME/.config/git/config 。

source: If <branch> is not found but there does exist a tracking branch in exactly one remote (call it <remote>) with a matching name, treat as equivalent to
zh_cn: 如果没有找到<branch>，但确切存在一个跟踪分支在一个远程(称之为<remote>)与一个匹配的名称，被视为等同于

source: If <branch> is specified, git rebase will perform an automatic git checkout <branch> before doing anything else.
zh_cn: 如果指定了<branch>，则在执行其他任何操作之前， git rebase 将自动执行 git checkout <branch> 。

source: If <branch> was provided when the rebase operation was started, then HEAD will be reset to <branch>.
zh_cn: 如果在 rebase 操作启动时提供了<branch>，则 HEAD 将被重置为<branch>。

source: If --list is given, or if there are no non-option arguments, existing branches are listed; the current branch will be highlighted with an asterisk.
zh_cn: 如果给出了 --list ，或者如果没有非选项参数，则列出现有的分支;当前分支将以星号突出显示。

source: If -B is given, <new_branch> is created if it doesn’t exist; otherwise, it is reset.
zh_cn: 如果给出了 -B ，若不存在 <new_branch> 将被创建;否则，它被重置。

source: If -N is specified, removed paths are marked as intent-to-add (see git-add[1]).
zh_cn: 如果指定了 -N ，则删除的路径被标记为意图添加(参见 git-add[1] )。

source: If -m <msg> or -F <file> is given and -a, -s, and -u <keyid> are absent, -a is implied.
zh_cn: 如果给出了 -m <msg> 或 -F <file> ，并且 -a ， -s 和 -u <keyid> 不存在， -a 是隐含的。

source: If GIT_DIR environment is not set, it is set to the current working directory.
zh_cn: 如果 GIT_DIR 环境未设置，则将其设置为当前工作目录。

source: If git commit exits due to an error before creating a commit, any commit message that has been provided by the user (e.g., in an editor session) will be available in this file, but will be overwritten by the next invocation of git commit.
zh_cn: 如果 git commit 在创建提交之前由于错误而退出，则由用户提供的任何提交消息(例如，在编辑器会话中)将在此文件中可用，但下一次调用 git commit 将被覆盖。

source: If -v is specified twice, then also show the changes in the working tree that have not yet been staged (i.e., like the output of git diff).
zh_cn: 如果指定了 -v 两次，那么还会显示工作树中尚未暂存的更改(即，像 git diff 的输出)。

source: If <count> is given, stop after showing that many refs.
zh_cn: 如果给出了 <count> ，则在显示许多引用后停止。
